Repository: siriusch/Sirius.MFiles
Catalog: Sirius.VAF.Extensions/Strings.*.resx
Languages: de, fr

# PhoneInvalidCountryCode
source: The number has an invalid country code.
de: Die Nummer hat eine ungültige Ländervorwahl.
fr: Le numéro à un code pays invalide.

# PhoneInvalidFormat
source: The number is invalid ({message}).
de: Die Nummer ist ungültig ({message}).
fr: Le numéro est invalide ({message}).

# PhoneInvalidLength
source: The number has an invalid length.
de: Die Nummer hat eine ungültige Länge.
fr: Le numéro à une longueur invalide.

# PhoneInvalidNumber
source: The number is not a valid number.
de: Die Nummer ist keine gültige Nummer.
fr: Le numéro n'est pas correct.

# PhoneLocalNumber
source: The number has no area code.
de: Die Nummer hat keine Vorwahl.
fr: Le numéro ne contient pas d'indicatif.

# PhoneTooLong
source: The number is too long.
de: Die Nummer ist zu lang.
fr: Le numéro est trop long.

# PhoneTooShort
source: The number is too short.
de: Die Nummer ist zu kurz.
fr: Le numéro est trop court.

# UidInvalidFormat
source: The UID has an invalid format.
de: Die UID hat ein ungültiges Format.
fr: Le format de l'UID n'est pas valide.

# UidInvalidChecksum
source: The UID has an invalid checksum.
de: Die UID hat eine ungültige Checksumme.
fr: La somme de contrôle de l'UID n'est pas correcte.

# PostalCodeInvalid
source: The postal code is invalid for country {countryCode}.
de: Die Postleitzahl ist ungültig für das Land {countryCode}.
fr: Le code postal n'est pas valable pour le pays {countryCode}.

# IbanInvalidChecksum
source: The IBAN has an invalid checksum.
de: Die IBAN hat eine ungültige Prüfsumme.
fr: L'IBAN à une somme de contrôle invalide.

# IbanInvalidFormat
source: The IBAN has an invalid format.
de: Die IBAN hat ein ungültiges Format.
fr: L'IBAN à un format invalide.

# InvoiceReferenceQrrInvalidChecksum
source: The QR invoice reference has an invalid checksum.
de: Die QRR-Referenznummer hat eine ungültige Prüfsumme.
fr: Le numéro de réference QR à une somme de contrôle invalide.

# InvoiceReferenceScorInvalidChecksum
source: The structured invoice reference has an invalid checksum.
de: Die SCOR-Referenznummer hat eine ungültige Prüfsumme.
fr: Le numéro de réference structuré à une somme de contrôle invalide.

# InvoiceReferenceQrrInvalidFormat
source: The QR invoice reference has an invalid format.
de: Die QRR-Referenznummer hat ein ungültiges Format.
fr: Le numéro de réference QR à un format invalide.

# InvoiceReferenceScorInvalidFormat
source: The structured invoice reference has an invalid format.
de: Die SCOR-Referenznummer hat ein ungültiges Format.
fr: Le numéro de réference structuré à un format invalide.

# OasiInvalidFormat
source: The OASI number has an invalid format.
de: Die AHV-Nummer hat ein ungültiges Format.
fr: Le numàro AVS à un format invalide.

# OasiInvalidChecksum
source: The OASI number has an invalid checksum.
de: Die AHV-Nummer hat eine ungültige Prüfsumme.
fr: Le numàro AVS à une somme de contrôle invalide.

# InvoiceReferenceQrIbanRequiresQrr
source: A QR-IBAN requires a QR invoice reference.
fr: Un IBAN QR exige un numéro de référence QR.

# InvoiceReferenceQrrRequiresQrIban
source: A QR invoice reference requires a QR-IBAN.
fr: Un numéro de réference QR exige un IBAN QR.

source: Invalid data.
fr: Données invalides.
